<#
#̷𝓍   𝓐𝓡𝓢 𝓢𝓒𝓡𝓘𝓟𝓣𝓤𝓜
#̷𝓍   🇵​​​​​🇴​​​​​🇼​​​​​🇪​​​​​🇷​​​​​🇸​​​​​🇭​​​​​🇪​​​​​🇱​​​​​🇱​​​​​ 🇸​​​​​🇨​​​​​🇷​​​​​🇮​​​​​🇵​​​​​🇹​​​​​ 🇧​​​​​🇾​​​​​ 🇬​​​​​🇺​​​​​🇮​​​​​🇱​​​​​🇱​​​​​🇦​​​​​🇺​​​​​🇲​​​​​🇪​​​​​🇵​​​​​🇱​​​​​🇦​​​​​🇳​​​​​🇹​​​​​🇪​​​​​.🇶​​​​​🇨​​​​​@🇬​​​​​🇲​​​​​🇦​​​​​🇮​​​​​🇱​​​​​.🇨​​​​​🇴​​​​​🇲​​​​​
#>

$Script:TimerStarted = $False
$Script:Timer = [Diagnostics.Stopwatch]::New()
$Script:DiffMs = 0

function Invoke-VirusTotalTest {
    [CmdletBinding(SupportsShouldProcess)]
    param()
    if($Script:TimerStarted -eq $False){
         $Script:TimerStarted = $True  
         $Script:Timer.Start() 
    }

    [float]$RequestTime = $Script:Timer.Elapsed.TotalMilliseconds
    Write-Verbose "RequestTime $RequestTime"

    Get-VirusTotalAuthenticationHeader
    
    
}
